trailcurrentoss/YouTubeCodeSamples/elecrow-esp32-p4-10-in/sdkconfig.defaults
# CrowPanel Advance ESP32-P4 10.1" — sdkconfig defaults.
#
# Mirrors the vendor's Lesson07 (Turn_on_the_screen) example, which is the
# canonical known-good sdkconfig for this board's LDO + MIPI-DSI + PSRAM
# setup. Trimmed to the flags that actually matter for boot; anything omitted
# uses ESP-IDF defaults.
#
# Edit THIS file, never sdkconfig — IDF regenerates sdkconfig on every build
# and any direct edit is silently overwritten.

CONFIG_IDF_TARGET="esp32p4"

# --- Flash — the CrowPanel Advance ships with 16MB. partitions.csv wants
#     8M factory + 2M spiffs = doesn't fit in the 2MB default. ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# --- PSRAM — required. LCD framebuffer is ~1.2 MB per buffer (1024x600x2);
#     with no PSRAM, display_init returns ESP_ERR_NO_MEM at boot. ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# --- Custom partitions (partitions.csv already in the project root). ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- LVGL color depth: 16-bit RGB565 (matches EK79007 panel and every
#     working CrowPanel example). ---
CONFIG_LV_COLOR_DEPTH_16=y

# --- Main task pinned to core 0. The lvgl_port task will pin itself to
#     core 1 inside display_init(), giving the panel refresh its own core. ---
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y

# --- sys_evt task stack (LessonsLearned #20). ESP-Hosted marshals big
#     wifi_ap_record_t batches on this task; the 2816-byte default overflows
#     on the first scan-done event. Bump to 6144.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=6144

# --- Internal-RAM reserve + mbedtls in PSRAM (LessonsLearned #20).
#     Keeps 128 KB internal available for DMA-critical allocations that
#     can't live in PSRAM. mbedtls (used by mqtts:// TLS) is a big
#     internal-RAM consumer by default; push it to PSRAM.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=131072
CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC=n
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=n
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

# --- TLS insecure — accept the Headwaters MQTT broker's self-signed cert
#     (LAN-only deployment). Same flags Fireside uses. Do NOT extend this to
#     Internet-facing hosts. mqtt_client.c also sets
#     skip_cert_common_name_check=true so the CN doesn't have to match.
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y

# --- Debug-friendly defaults — matches vendor examples so a support bug
#     report has the same code footprint. Bump to RELEASE later. ---
CONFIG_COMPILER_OPTIMIZATION_DEBUG=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y

# --- LVGL memory — use system malloc so LVGL's heap comes from PSRAM.
#     Default is a fixed 64KB LV_MEM pool which is nowhere near enough for
#     22 styles + 10 pages of widgets. Symptom of running out: NULL deref
#     inside lv_obj_add_style (obj->styles = lv_mem_realloc(...) returns
#     NULL) during the first lv_obj_create at boot. ---
CONFIG_LV_MEM_CUSTOM=y

# --- LVGL indev polling period. Default is 30 ms, which means LVGL reads the
#     GT911 roughly every other refresh frame. With the touch indev in
#     polling mode (Touch_GPIO_INT set to NC, see LessonsLearned #28), a light
#     or brief tap can start and end inside a single 30 ms window and LVGL
#     misses it, so the tap "doesn't take" and the user learns to press
#     harder / longer. Drop to 10 ms — three reads per frame at 30 fps,
#     enough to catch a quick capacitive contact without meaningful CPU cost
#     (each read is one small I2C transaction). ---
CONFIG_LV_INDEV_DEF_READ_PERIOD=10

# --- LVGL default theme kept ENABLED. EEZ Studio's C export calls
#     lv_theme_default_init() unconditionally in screens.c; disabling
#     LV_USE_THEME_DEFAULT breaks that call. Our named styles override
#     what we care about; the design-polish "kill blue chrome" pass will
#     use lv_disp_set_theme(NULL) at runtime or bind to lv_theme_basic
#     via C code instead of via Kconfig.
CONFIG_LV_USE_THEME_DEFAULT=y

# --- All UI fonts are custom Roboto / FontAwesome via ui_font_*.c files
#     (Roboto Light/Regular/Medium + FA solid subset). No Montserrat built-ins
#     referenced. lv_font_montserrat_14 is still needed as the LVGL library's
#     internal default (theme fallback) but every other size is disabled to
#     keep flash footprint tight.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
